// Коли документ буде готовий (повністю завантажиться)
$(document).ready(function(){
    // Отримуємо усі кнопки та кожній кнопці застосовуємо функцію
    $(".add-to-favourite").each(function(){
        // Обробка події, що спрацює при натисканні на кнопку
        $(this).on("click",function(){
            // Формуємо AJAX-запит
            $.ajax({
                // Вказуємо url, на який AJAX робитиме запит. Беремо url з атрибуту value поточної кнопки
                url: $(this).val(),
                // Вказуємо тип запиту
                type: "get",
                // Функція, що відпрацює при відповіді від сервера про успіх
                success: function(response){
                    console.log("success")
                }
            });
        });
    });
});